{"title":"This post title from external JSON or API","content":"<p>Nowe technologie pojawiają się na rynku w zawrotnym tempie, technologiczna rewolucja dotyka prawie każdej z dziedzin w tym nauki języków obcych. Systemy nauczania języków powoli ewoluują, a tradycyjne metody odchodzą do lamusa. Dzieje się tak nie tylko ze względu na postęp technologiczny i możliwości jakie dzięki niemu uzyskujemy, ale także ze względu na świadomość ludzi chcących uczyć i chcących się uczyć języków obcych. </p> <p>Wyróżniamy kilka rodzajów nauczania wspomaganego przez technologie oto niektóre z nich:</p> <p>TBLL technology- based language learning - nauczania w oparciu o technologie główna grupa opisująca wsparcie nauki języków</p> <p>CALL - Computer-assisted language learning - nauczanie wspomagane komputerowo </p> <p>MALL - Mobile-assisted language learning - nauczanie poprzez urządzenia mobilne takie jak smartfony, odtwarzacze mp3 czy tablety </p> <p>IBLL - Internet-based language learning - nauczanie przez internet najpopularniejsza metoda która stała się szybkim trende, dającym nieograniczone możliwości, rozmowy przez skype pozwalają na kontakt z native speakerami w każdym zakątku świata</p> <p>GALL - Google-assisted language learning - nauczanie wsparte narzędziami google jest to podgrupa IBLL, która bardzo szybko uzyskała swoją własną nazwę, jak wiemy Gigant Google udostępnia narzędzia ułatwiające pracę w na wielu płaszczyznach te rozwiązania przyjęły się też w nauczaniu języków.</p> <p>Tradycyjne systemy dydaktyczne jeszcze kilka lat temu nie pozwalały na szybsze przyswajanie języka, ilość godzin poświęconych gramatyce i zadaniom tekstowym była znacznie większa niż tych poświęconych konwersacjom. Schematy wkuwania regułek i niezliczonej ilości słownictwa spowodowały, że zaczęliśmy szukać alternatywnych sposobów przyswajania nowej wiedzy. Rozwój technologiczny czy komputeryzacja w kilka lat zrewolucjonizowała rynki wszystkich gałęzi przemysłu w tym edukacji i w zawrotnym tempie rozwija się, z dnia na dzień rosnąć i wprowadzając nowe rozwiązania. </p> <p>Wizje przedsiębiorców, czasami są bardzo futurystyczne, jednakże nasza cywilizacja doszła do momentu, gdzie bliżej nam do superkomputerów i kosmicznych rozwiązań niż nam się zdaje.</p> <p>Ale zejdźmy na ziemię, nikt tutaj nie mówi o wizji rodem z filmu Matrix i maszynach pompujących w nasze mózgi terabajty informacji pozwalające na zapisanie ich jak na dysku twardym. Mowa tutaj o narzędziach, które mogą nam usprawnić tą jakże ciężką przeprawę jaką jest nauka języka obcego czyli, różnego rodzaju aplikacjach czy programach komputerowych, a jest w czym wybierać. </p> <p>Współczesne badania pedagogiczne szukają rozwiązań w wykorzystaniu nowych technologii w nauczaniu. Rynek technologiczny rozrasta się w zawrotnym tempie dając nam szeroką paletę różnorodnych narzędzi. Aplikacje na smartphony i programy komputerowe do nauki języków wyrastają jak grzyby po porannym deszczu. Multimedialne fiszki, słowniki i tym podobne są często rekomendowane dla osób podejmujących się nauki samemu. Oczywiście wiele szkół czy firm zajmujących się treningiem językowym posiada swoje własne aplikacje ale najwidoczniej to za mało, minął  zaledwie bardzo krótki okres czasu i te rozwiązania powoli zaczynają być spychane na drugi plan. Najnowszy trend jakim jest wirtualna rzeczywistość (Virtual Reality) wspierany przez ogromne korporacje i lansowany jako technologia jutra, która skutecznie ma wyprzeć dotychczasowe rozwiązania. Wiele firm próbuje wybić się na rynku i pokazać nowe możliwości, oczywiście dotknęło to także edukacji. Matematyka, geografia, fizyka czy biologia, badania i wizualizacje w świecie 3D wydają się być genialnym rozwiązaniem, Jednak nauka języka to przecież zupełnie coś innego. Stworzenie idealnego środowiska do nauki może być trudnym zadaniem, to nie jest to samo co rysowanie funkcji na osiach XYZ w matematyce za pomocą narzędzi 3D. Odtwarzanie scenek, możliwości dialogu i interakcji z nauczycielem czy native speakerem jest czymś zupełnie innym, wręcz niewykonalnym, a jednak niektóre firmy starają się stworzyć takie środowisko.</p> <p><a href='https://www.youtube.com/watch?v=AWWl7gda1M4'>www.youtube.com/watch?v=AWWl7gda1M4</a></p> <p>Czy to walka o pozycje na rynku czy prawdziwe plany wykreowania przestrzeni sprzyjającej nauce języków? Jedno jest pewne minie jeszcze dużo czasu zanim takie rozwiązania zostaną rozwinięte i oddane do użytku.</p> <p>W ciągu kilku ostatnich lat nowe technologie przyczyniły się do rozwoju nauki języków powodując, że przyswajanie języka jest łatwiejsze i skuteczniejsze. </p> <p>Czy aby na pewno?</p> <p>Trudno nie znaleźć teraz szkoły, która nie oferuje nowych technologii czy metod nauczania. <br> Nauczyciele wybierają spośród różnego rodzaju technik umożliwiających skuteczniejsze nabycie języka. Jednak najlepsze zautomatyzowane programy nauczania czy aplikacje stają się cennym nabytkiem dopiero wtedy kiedy nauczyciel odpowiednio z nich korzysta i wprowadza do środowiska szkolnego. </p> <p>Badania wykazują, że uczący się chętniej sięgają po nowe metody, aplikacje mobilne czy oprogramowanie komputerowe, Jednak w praktyce wygląda to trochę inaczej. Połączenie z internetem jest rozwiązaniem i klątwą zarazem. Z jednej strony możemy bez problemu wyszukać odpowiedzi na nasze pytania, czy znaleźć odpowiednie materiały dydaktyczne, z drugiej jesteśmy o krok od zajrzenia na facebooka czy innych zjadaczy czasu i produktywności. Wszystko zależy od wykorzystania, Multimedialne klasy, wykorzystujące nowe technologie powodują, że przyswajanie nowego materiału przez uczących się jest łatwiejsze i przyjemniejsze to wszystko dzięki wszelkiej maści rozwiązaniom, jak tablice interaktywne, aplikacje czy gry edukacyjne.</p> <p>Metody nauczania na odległość pomagają nauczycielom w rozszerzeniu możliwości nauki dla wszystkich zainteresowanych studentów, niezależnie od ich miejsca zamieszkania, a aplikacje na smartfony skutecznie zastąpiły nam ogromne ilości drukowanych fiszek. </p> <p>Te zalety pozwalają nam wywnioskować, że multimedialna nauka daje ogromne możliwości w nauczaniu języków. Niewątpliwie jest ona lepsza i bardziej skuteczna niż tradycyjny system dydaktyczny, który mimo postępu technologicznego i metodycznego świata został gdzieś w tyle. </p> <p>Jednak naukowcy silnie doradzają dyrekcji szkół i uniwersytetów aby pozostali odpowiedzialni w wdrażaniu nowych technologii i instruowali nauczycieli jak z nich korzystać. Redukcja kosztów poprzez zastąpienie nauczycieli oprogramowaniem komputerowym czy innymi technologiami, może spowodować marne wyniki w modelu biznesowym, ale co ważniejsze może obniżyć poziom nauczania i spowodować, że uczący się będą mieli mniej możliwości do interakcji i rozmowy z kwalifikowanymi nauczycielami, którzy poprowadzą ich w ich drodze do biegłości.</p> <p>Wszystkie te rewolucyjne metody, programy czy urządzenia nie są wstanie za nas nauczyć się języka. Jest to bardzo ważne, gdyż bez odpowiedniej motywacji i skupienia nie osiągniemy naszych celów. Tylko to pozwala nam na uzyskanie satysfakcjonujących nas wyników, a złe zestawienie odpowiednich narzędzi, może nie dawać oczekiwanego efektu. Dlatego właśnie odpowiedni dobór materiałów, metod i narzędzi wspierających przyswajanie języka powinien być zawsze rozważany jako pierwszy, zanim zaczniemy naukę.</p>"}